SunCity/src/InformationRegisters/ЛогДействийКассираВРМК/ЛогДействийКассираВРМК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛогДействийКассираВРМК</name>
  <resources>
    <name>УменьшениеСуммыЧекаККМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВходящиеДанные</name>
    <type>
      <types>CatalogRef.ИнформационныеКарты</types>
      <types>CatalogRef.СкидкиНаценки</types>
      <types>CatalogRef.СерииНоменклатуры</types>
      <types>String</types>
      <types>CatalogRef.СерийныеНомера</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>Number</types>
      <types>CatalogRef.Пользователи</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВходящаяНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходящаяХарактеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящиеДанные</name>
    <type>
      <types>CatalogRef.ИнформационныеКарты</types>
      <types>CatalogRef.СкидкиНаценки</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.СерииНоменклатуры</types>
      <types>String</types>
      <types>CatalogRef.СерийныеНомера</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>Number</types>
      <types>CatalogRef.Пользователи</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеИсходящиеДанные</name>
    <type>
      <types>CatalogRef.ИнформационныеКарты</types>
      <types>CatalogRef.СерийныеНомера</types>
      <types>Number</types>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОперации</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДействияКассираВРМК</name>
    <type>
      <types>EnumRef.ВидыДействийКассираВРМК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗамещаемыйПользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЧекККМ</name>
    <type>
      <types>DocumentRef.ЧекККМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторФормыПредварительныхДанных</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SunCity/src/CommonModules/ЛогированиеДействийКассира/Module.bsl
#Область ПрограммныйИнтерфейс

// Записывает действие кассира.
//
// Параметры:
//  ВидДействияКассираВРМК - Строка - идентификатор вида операции кассира в РМК.
//  СтруктураЛога - Структура - структура записываемая в регистр.
//
Процедура ЗаписатьЛогОперации(ВидДействияКассираВРМК, СтруктураЛога) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураЛога.Вставить("ВидДействияКассираВРМК", Перечисления.ВидыДействийКассираВРМК[ВидДействияКассираВРМК]);
	МенеджерЗаписи = РегистрыСведений.ЛогДействийКассираВРМК.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураЛога);
	МенеджерЗаписи.Записать();
	
КонецПроцедуры // ЗаписатьЛогОперации()

// Заполняет предварительные записи лога.
//
// Параметры:
//  ЧекККМ  - ДокументСсылка.ЧекККМ - чек ккм, вносимый в данные регистра
//  ИдентификаторФормыПредварительныхДанных - УникальныйИдентификатор - уникальный идентификатор по которому подбираются предварительные данные.
//
Процедура ЗаполнитьПредварительныйЛог(ИдентификаторФормыПредварительныхДанных, ЧекККМ) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ЛогДействийКассираВРМК");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		УстановитьПривилегированныйРежим(Истина);
		
		НаборЗаписей = РегистрыСведений.ЛогДействийКассираВРМК.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторФормыПредварительныхДанных.Установить(ИдентификаторФормыПредварительныхДанных);
		НаборЗаписей.Прочитать();
		ТаблицаНабораЗаписей = НаборЗаписей.Выгрузить();
		ТаблицаНабораЗаписей.ЗаполнитьЗначения(ЧекККМ, "ЧекККМ");
		НаборЗаписей.Загрузить(ТаблицаНабораЗаписей);
		НаборЗаписей.Записать(Истина);
		
		ЗафиксироватьТранзакцию();
		УстановитьПривилегированныйРежим(Ложь);
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры // ЗаполнитьПредварительныйЛог()

Процедура ОчиститьЛогДействийКассира(Отказ, СообщениеОбОшибке) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ЛогДействийКассираВРМК");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		УстановитьПривилегированныйРежим(Истина);
		
		НаборЗаписей = РегистрыСведений.ЛогДействийКассираВРМК.СоздатьНаборЗаписей();
		НаборЗаписей.Записать();
		
		ЗафиксироватьТранзакцию();
		УстановитьПривилегированныйРежим(Ложь);
		
	Исключение
		
		ОтменитьТранзакцию();
		Отказ = Истина;
		СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
КонецПроцедуры
#КонецОбласти
